Training/Solvers/laminarSolverSteady/run/counterFlowFlame2D/01-global-1step/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application        laminarSolverSteady;

startFrom          latestTime;

startTime          0;

stopAt             endTime;

endTime            2000;

deltaT             1;

writeControl       timeStep;

writeInterval      200;

purgeWrite         0;

writeFormat        ascii;

writePrecision     9;

writeCompression   off;

timeFormat         general;

timePrecision      6;

graphFormat        raw;

runTimeModifiable  true;

// ************************************************************************* //

