Training/Solvers/laminarSolverSteady/run/counterFlowFlame2D/01-global-1step/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
	solver           	GAMG;
        tolerance        	1e-7;
        relTol           	0.01;
        smoother         	DICGaussSeidel;
        cacheAgglomeration 	true;
        nCellsInCoarsestLevel 	10;
        agglomerator     	faceAreaPair;
        mergeLevels      	1;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-06;
        relTol          1e-04;
    }

    T
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-09;
        relTol          1e-06;
	minIter		1;
    }

    Yi
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-09;
        relTol          1e-07;
	minIter		1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    pMinFactor               0.8;
    pMaxFactor               1.2;

    residualControl
    {
	default		1e-16;
        p               1e-16;
        U               1e-16;
    }
}

relaxationFactors
{
    fields
    {
        p               0.20;
        rho             0.05;
    }
    equations
    {
	default         0.3;

        U               0.3;
        T               0.3;
    }
}


// ************************************************************************* //
